GNU gdb (Ubuntu 7.7.1-0ubuntu5~14.04.2) 7.7.1
Copyright (C) 2014 Free Software Foundation, Inc.
License GPLv3+: GNU GPL version 3 or later <http://gnu.org/licenses/gpl.html>
This is free software: you are free to change and redistribute it.
There is NO WARRANTY, to the extent permitted by law.  Type "show copying"
and "show warranty" for details.
This GDB was configured as "x86_64-linux-gnu".
Type "show configuration" for configuration details.
For bug reporting instructions, please see:
<http://www.gnu.org/software/gdb/bugs/>.
Find the GDB manual and other documentation resources online at:
<http://www.gnu.org/software/gdb/documentation/>.
For help, type "help".
Type "apropos word" to search for commands related to "word"...
Reading symbols from a.out...done.
(gdb) break 14[K5
Breakpoint 1 at 0x400813: file brokengdb2.cpp, line 15.
(gdb) break  [K17
Breakpoint 2 at 0x40081f: file brokengdb2.cpp, line 17.
(gdb) run
Starting program: /home/student/EE355/Lab5/a.out 

Breakpoint 1, main () at brokengdb2.cpp:15
15			year++;
(gdb) print balance
$1 = 110
(gdb) step
11		do
(gdb) steo[Kp

Breakpoint 2, main () at brokengdb2.cpp:17
17		cout << year << "No. of years to achieve target balance.\n";
(gdb) step[K[K[K[Kprint valu[K[K[K[Ktarget
$2 = 1000
(gdb) print balance
$3 = 110
(gdb) next
18		return 0;
(gdb) on[K[Kcontiun[K[Knue
Continuing.
1No. of years to achieve target balance.
[Inferior 1 (process 3374) exited normally]
(gdb) quit
